---
kind: method
id: M:Autodesk.Revit.Creation.Application.NewReferenceArray
source: html/4b6ef509-e286-019c-cdc1-832cdc0ef8aa.htm
---
# Autodesk.Revit.Creation.Application.NewReferenceArray Method

Creates a new instance of a reference array.

## Syntax (C#)
```csharp
public ReferenceArray NewReferenceArray()
```